* Watch this video on Rust from Python perspective
[[https://www.youtube.com/watch?v=IYLf8lUqR40][Why would a python programmer learn rust when there are no jobs in it - YouTube]]
Read it.

#+BEGIN_SRC sh :async :results verbatim drawer
  readsubs "[[https://www.youtube.com/watch?v=IYLf8lUqR40][Why would a python programmer learn rust when there are no jobs in it - YouTube]]"
#+END_SRC

#+RESULTS:
:RESULTS:
okay

so this talk was originally a talk I gave for
HEPA can die

haven't updated the date and time that's
scientific computing data center manager
conference and I was telling them about rust
which was my latest experiments

and I've updated the talk a couple of times
since

but I obviously haven't updated the date

so let's get on my general opinion about
programming language is

is I want them to work with other programming
languages I really want them to interface with
C

I want them to have a really significant
advantage before I'm willing to invest in them

and um Python was a great leap forward for me
in terms of productivity

and that's why I fell in love with it

I need to be able to do a certain series of
tasks usually my jobs involve writing CLI
applications with a database having logging
processing Jason things like that

and I've tested all of these use cases before
I've presented anything about rust and rust

is really passed with flying colors so let's
jump back and say why do I like Python it's
really fast to write it's really quick to
debug and most applications don't need
performance and

so while it's 100 times slower than C roughly
it's usually fast enough and duck typing is
wonderful it was a revelation to me when I
came to Python first where things are like the
things that you expect them to be good enough
error handling

I really disliked C++ is our inheritance
models and stuff like that

and I thought pythons there was so much
cleaner and my god

the tooling has improved over the year

so I've been using Python since 2006 with
talks virtual end PI tests mock

really is a pleasure to to debug things into
PI it with Python and make things solid sadly
there are little corners

but anyway we'll jump forward

but Python you have some real compromises and
while pison is where I make my how I employ
myself it doesn't solve every problem that I
have one of the biggest compromises with
Python is the global interpreter lock which
means that when you do multi-threading you're
doing multi-threading because you need to do
multiple things concurrently you can't get a
performance increase by doing multi-threading
in Python so that is a major problem with
Python

and generally it's

performance is slow can't really use Python in
an embedded environment very easily although
there are variants of Python for embedded
environment

but that's another story

well please don't get confused by that one
memory usage swig these things have all caused
problems but we haven't got long to talk about
all these slides

so I'm not going to read everything

so how do we work around pythons limitations
if we're working in Python

well you can rewrite everything there it can
be very revolutionary or you can be
incremental and make native C bindings for the
performance critical areas ah yes and foreign
function calls from Python can be done

but it's kind of one of those problems

so I said see what makes me avoid C

well I find for me

I know that there are gurus out there

but I find development is really really slow
compared to Python I find debugging really
hard

I've I got to write C reasonably at one point
in my career a long time ago

and I've forgotten it all okay

not all of it but quite a lot of it

and now I just find it really hard work with
compiler errors don't have that many memory
management issues but sometimes the libraries
I worked with did and in terms of being
efficient with memory well I never quite got
the hang of that because I was more focused on
making sure that didn't get leaks so swings
and roundabouts and C++

well people told me this was gonna be a great
leap forward

i

pre date in my c++ time all the big advanced
things that happen in c++ 11 and c++ 17 that
made it a much better language I'm told by my
friends who were experts in C++

so my memories are and being slow debugging
being hard multi-threading being hard compiler
errors STL traces that go off the screen

oh it was suffering

and so I went back to see when I used to be a
C++ programmer under GCC

so why did I try rust

well I've been to the CCC conference in
Hamburg

last time it was here

and I've been to false gem and there was quite
a buzz around a lick sir and rust and elixir
was derived from Lang

and I'd already had a look at that and
realized it was a great programming language
but not really fitting all my use cases

and I wanted something bit more Universal
native and compiled with things I had a use
cases for

and I wanted to extend Python

and I wanted something to be as fast as C and
C++

but with need when needed

and I didn't want garbage collection because I
didn't want one garbage collector to fight
with another freeing of resources in Python
because I wanted it for embedding in other
languages

and I'd heard something about rust being

may be useful for multi-threading and to be
quite honest

I wanted to pick up another language

and I thought maybe something had happened in
the ten years since Python was invented

so there's some interesting design decisions
probably most important factor to understand
about rust as it was designed by Mozilla for
very much a practical purpose how can we make
our code more reliable and more safe and how
can we incrementally improve the product that
we have Firefox

I'm not a Firefox developer but that was their
use case and

so that was really interesting incrementally
changing to a new language that really stuck
in my mind of something special now zero
abstraction overhead philosophy

just likes C++

what that means is it's gonna run as fast as
we can

yeah

and it's your fault

if it doesn't run fast rather than pythons
fault or someone else's fault no big garbage
collector but a borrow checker now the word
borrowed check is going to come up a couple of
times in this talk

and I'm gonna try and not go into it for a few
seconds but please at the end if I haven't
explained enough

let's get on to that multi-threaded support
baked into the type system now that's linked
the burro check of stuff but long and short of
it

is you can be pretty fearless about writing
multi-threaded code because you get a type
error and it won't compile if it's not thread
safe now

that's pretty awesome variables are immutable
by default now

I know one person here is an inter functional
programming and this is just how he would like
the world to be and

once you sit there and work in a world where
variables are immutable by default you think
this is a major bug in C and a major bug in
C++

and you realize that for backwards
compatibility they can never fix it

and it's kind of sad

but life's like that we still use QWERTY
keyboards enumerated types with parameters now
this is all stolen from ml

and it's absolutely wonderful

and I'll show you an example later

but it's a very long word for saying
parameters can be put into enumerated types

so my first experience about rust well a lot
was unfamiliar to me they have a whole
ecosystem around them rust up a tool chain
updater that made me scream cargo which it's
an entire behavior made me scream

and I'll explain why very soon

and then they flat there and threw away object
orientation which made me initially go why the
hell are you reinventing the wheel

and then they said the getting rid of
exception handling as well

I wasn't unhappy with the idea of LLVM that
initially my prejudice was okay with

and then there's Baro checker stuff which
pretty quickly I felt was revolutionary but

other concerns came in just as I was getting
aware of these things about maturity of the
tools

so let's get on to these things and see why
they made me scream and why they continued to
make me a little bit upset

yeah

so rust up is the default way to get a rough
development environment and this goes
completely against the Debian policy basically
you don't download a script install it in the
system or what slide am i on

ok

I'm going a bit too slowly and it downloads
all of the build tools and plug them into your
directory off the web I wasn't really happy
for it

it's got good reasons for it it can now be
avoided for rusts stable on platforms like
Debian you've now done a great job of
packaging cargo packaging rafts they now exist

but if you want to work with cross compiling
if you want to work with rust nightly and
there are occasional reasons why you might
want to do both of those things then rust up
is the appropriate way to do it at the moment
as a rust developer

I hope Debian has another solution sometime in
the future cargo really scared me at first
this you sit there and you make a nice tamil
file which is a bit like a Windows any file
and you describe your build dependencies and
it downloads things from the web

and that was a bit scary to me at first

I was totally upset by this for reproducible
builds having a new package

is all of that the cargo team have changed
things a lot since I've been using it now

there's ven

during which means that you can download all
of these dependencies off the and store them
on disk so even if you're not working with
Debian's excellent packaging plans for rust
you can still have a repeatable build

it's very simple to use

and there's a build RS thing which is a pre
compete of rust code that you can compile
before the rest is compiled for doing things
like extending your applications automatically
generating C bindings all the sort of things
you might do with all the tools

sorry

I'm a bit out of date

I don't know C make so the rust compiler is
slow really really slow it makes C++ compiler
seem fast

this is this is not nice but the error message
is on the other hand they blow away the C++
compiler and any compiler I have ever seen in
my life

I can't say I've seen house Kelvin things like
that

but I've seen a little bit

and it sometimes even tells you the correct
solution to the problem that you're trying to
have

and it's fussy

it's so fussy the rough compiler the almost
always when you actually manage to fight with
the RUS compiler enough to make it compile

it almost always does what you expect first
time now that's kind of weird for me
particularly after having used Python and the
board checkers lovely

so I'm going to carry on running fast now so
rust error handling as I said no exceptions
basically there is a panic unrecoverable thing
and you can recover from it just like this
kind of corner cases I said you it was
unrecoverable

but I know more than oh did when I first wrote
these slides there are recoverable errors and
these are done with parameterised enumerated
types so you basically say that the output of
a function has a result type

and then you have the okay type and the error
type

and then you can use the error type and at
first when I started programming in rust my
code was growing because I was matching on
which types am I getting back from my function
and then handling the error

but if you keep the error type consistent
between the functions you can just pass it up
like an exception would up the stack by using
the question mark operator so that makes the
language really quite succinctly breeze like
error chain is starting to be deprecated so
what oh

why is rust

not quite oo

well it's almost oo

it doesn't support inheritance

they don't have methods directly applied to
objects in the same sort of syntax

goes very very similar and I'll show an
example in the next slide

and we have the concept of traits which are a
bit like interfaces in Java or polymorphic
behavior in arrow and I've yet to see no
downside

and I'll just show you an example of the code
on the next page very very quickly

so here we have a structure very much like a
see structure here

we have a oh sorry

yes

so and here we have a function that's
converting point to string that said that
exists and here is an implementation of points
methods

and there's a two string thing it's really

you don't actually need the line on line seven

so here's an example of a hash function being
implemented for two different types and this
shows the strength of using traits rather than
arrow because here we are implementing hash
for bool

yes

but we don't control the bull type

so we can implement methods

implement methods of traits implement traits
for objects we don't control

and that means you have some flexibility when
you're working with external libraries that
you couldn't get with

oh oh I think it's rather nice

and here's another example of just a really
cool library using some macros to decorate a
structure

and that's all you need to do to make
something serializable and be serializable in
rust using the beautiful surgery library which
goes very fast and is great because it gives
you full type checking which you also get with
rust

okay

I've really got hurry because I'm running out
of time

and I've got far too much content here

the burrow check are basically the concept is
only one thing to know in the own memory at
any one time to change things and multiple
readers can happen at the same time to get
around this with multi-threading you then have
a reference a reference count action and in
here at that with a lock type so you can get a
mutable access to the reference and when the
lock goes out of scope

it's automatically unlocked

so it becomes very easy to share blocks of
memory between different rust threads

but you've still probably better off using the
communication via messaging between threads
for most things because it's safer and you're
less likely to get into deadlocks but

the whole consequence of this is that not only
do we get out of the type system thread safety

but we also get something like garbage
collection

but without the periodic stopping of garbage
collection we get something quite real-time
there

so if that is really rather wonderful

and Apple's going to steal the idea and put
into Swift very soon

I've heard ok

this is just a random example of my original
use case for why I wanted to sit there and
play with a more low-level language like C or
C++ or rust we can very easily embed rust into
Python

I've had I've got played with this quite some
depth

it's a little bit too naive for me to sit
there

sorry a bit too immature for me to sit there
and say it's properly production you do need
to work with rust nightly this is not readable
on these slides I decided there was no point
me even trying to make it readable

but it gives you an idea of how little code is
needed to make a word search in from the word
search example on the main

the main PI o 3 git repository

it's really really trivial to import things
I've extended this example and played around
with Sergey for serializing and deserializing
to make some benchmarks against Python and
rust

but I want to go a little bit further before I
release the figures

but I sit there and say the rust is so much
faster so rust issues I've found this is
probably the most valuable bit of the talk
because people don't often tell you things
that they don't like so it's only implemented
with LLVM

so it's not 100% self-supporting language

I think that's a really important failing of
rust actually

but I can totally see why it's happened from
an engineering pragmatic perspective

there's no stables see ABI you can export C
trivially by just decorating method and
functions and types

it's really easy

but you can

but then you're using the C API

it's like C++ is not stable and rust is not
easy to learn it's nowhere near as easy to
learn as Python

but if you're familiar with

Cu C++

Pascal

those sort of languages Delfy anything the way
you've been using raw memory ax management
yourself

it won't seem that different from what you
have learnt as best practice it kind of
enforces best practice and that's what the
burrow checker does and it sometimes hurts you
in ways that you didn't realize and

you go

oh my god I've been making this mistake in C
all my life

well that's how I felt about the Burrow
checker

I think it's much harder if you grew up with
JavaScript by default cargo downloads from the
internet you have to work a little bit to stop
it doing that

and async IO is a weak point in rust

it's only the past year that there's been a
story for async IO

so this is where we don't do blocking requests
using the old traditional C API from the 70s

we start modernizing ourselves and using the
1980s api's of the UNIX kernel and that's only
happening now some things still require us
nightly when I first started playing with rust
it was nearly everything and incremental
builds

reach stable around about the time I gave
first gave this talk meta programming tools
and some of the features of macros haven't
been fully standardized out by the rough
standardization groups and so some of these
things have been left in rust nightly for a
quite a long time

and I've found whenever I've wrapped C code

I have to use the unsafe command and when ever
I use the unsafe command

you know

I said the compiler was absolutely lovely soon
as you put the unsafe keyword

and you wrap the code suddenly all of the

I think you actually meant to do this

and it being right goes away

it just says era

yes you're wrong so it does encourage you not
to use the unsafe keyword too much anyway so
from Python person's perspective

what hurt probably most was the semicolon
thing so functions just returning because you
didn't put a semicolon at the end and this
then not matching the function signature

and then we're getting an interesting type
error and python mocking is so nice

and it's just not as easy in rust

you don't get the ability to monkey patch a
function for the purpose of testing

and I do miss heissen sometimes with rust and
rust is a little bit more verbose anyway so
long in summary rust is fast

the code nearly always does exactly what you
expected the first time you run it

and you've successfully fought the compiler it
has great libraries to get things done and

the quality of code going into such an
immature language is amazingly high arc pass
is about the third evolution in Python and
clap the command line processing library in
rust is just way ahead and lots of things like
that directly inspired from C++ and Python
libraries all over the place

it really fast executables

you are

I guess a parametrized enumerated types are
probably my favorite thing about rust

and that's totally stolen from ml

the bourchek is a great compromise last things
I met will sit there and say is rust

is really new 2015

may the 15th was the 1.0 release

but it's been very popular

it's got a huge flow following on Stack
Overflow and while I hear from C++ devs that
C++ 17 has most of the features of rust pi

I would say rust is much easier to get your
head around and you don't have to learn all
things that existed before C++ 17 to learn the
language

and it's really yet to disappoint me here

are some references in the slide here are some
big companies what they're doing

I sat there and talked for too long and
probably run over time

so thanks do I have time for questions so one
or two quick questions

what I have a question

so what's the time frame for the releases is
that every three months is a

whenever they're ready or every six weeks

every six weeks

okay

yeah

but that's really quite small incremental
releases

any other questions [Applause]
:END:

* TLA+ elasticsearch
[[https://www.youtube.com/watch?v=qYDcbcOVurc][Using TLA+ for fun and profit in the development of Elasticsearch - Yannick Welsch - YouTube]]

#+BEGIN_SRC sh :async :results verbatim drawer
  readsubs "[[https://www.youtube.com/watch?v=qYDcbcOVurc][Using TLA+ for fun and profit in the development of Elasticsearch - Yannick Welsch - YouTube]]"
#+END_SRC

#+RESULTS:
:RESULTS:
so hi my name is yannick I work at elastic
company behind the open-source product called
elastic search

I'm here today to tell you about our various
uses of chilli plus in the development of this
product so elastic search is a distributed
search analytics engine it was initially
released by Shabana in as a multi-purpose
search engine that allows you to search any
kind of data it is based on Apache leucine
which is an IR library written in Java created
by decoding 20 years ago and still undergoing
active and innovative development today
elastic search is typically used for low kanna
lytx full-text search operational and security
intelligence business analytics metrics use
case and

more so if you go and stack overflow or if you
search on github on Wikipedia you're using
elastic search if you have taken an uber
yesterday from the airport to hotel or if
you're feeling lonely tonight and you're
looking for a date on tinder it's all powered
by elastic search

so I'm going to share pick a few key parts of
the architecture here so that I can read later
them later on in our telly plus story and

in contrast to typical talks about elastic
search I'm not going to focus so much on the
such aspects on the system

but more it's distributed architecture data
replication elastic search is based on a so
called partitioning or sharding model which
allows so which lost cluster to scale
horizontally so collection a logical
collection of data which in elastic search is
called an index is split into so-called charts
and these charts can then be allocated to
different machines karenge the index can then
be done by these machines in parallel charts
also replicated so we create additional copies
of these charts and replicas allow
distributing reads so you can just pick any of
the copies for reading as well as give you
full tolerance if one of the notes goes down

there's another copy available on one of the
other notes in elastic search

the number of shots is fixed adding X creation
timer as the number of replicas is dynamically
adjustable data replication happens at the per
shot level so for each shot it's completely
independent and we finish shot is also highly
concurrent one of the short cop is called the
primary so that's your main copy of the data
and all other copies are called replicas and
varieties all ways first go to the primary and
are then in parallel replicated to all
replicas

and he's already all the basics for data
replication now the cluster level we have our
clustering a cluster coordination a metadata
application layer

so the metadata determines which illnesses are
part of the clusters what are the logical
collections and also what their schema is

it also contains information about which shard
copies are located to which nodes so
essentially what we see here in this picture
and also contains information of the sub but

the subset of short copies are that are in
sync so those are the copies that contain the
most recent rights and only those can become
primaries now all this information is captured
in an object that's called the cluster state
and this object is shared by and available on
all nodes in the cluster this allows every
node now in the cluster to smartly route
requests as well as coordinate searches given
a Dinos for the different pieces of the data
reside the data application layer now which
typically runs with two short copies relies on
this meta data replication layer for
correctness so to identify the in sync shard
copies

but otherwise the two are pretty independent
so to summarize we have this metadata
replication layer

it's low throughput involves all nodes in the
cluster

and it only comes into play when you update
your schema or when you're not no drops out of
the cluster and you need to relocate your
short copy to a different node and on the
other hand you have the data application layer
that when it's high throughput and it's far
more targeted only to those nodes that hold a
copy of the specific shot so if this
architecture in mind now let's dive into our
story and how we came to use tle plus so
before I joined elastic I was working in the
company that from a very early point on
started to run very large elastic search
clusters so in with version 1.3 which was
released in 2014 we were running a 700 node
cluster destroying more than a petabyte of
data and while it was stunning to see elastic
scales

so well there were a number of unique
challenges with that

so there were situations where elastic search
could lose data both caused by issues at the
metadata as well as data replication layer
however at that level of scale storing the
data in a secondary system for safety purposes
I suppose very costly as well as impractical
and so as more users building these clusters
with more and more demanding use cases the
resiliency fault-tolerant as well as scaling
requirements kept increasing and to address
these concerns the elasticsearch team set out
on a multi-year journey to improve the
robustness and scalability of the system our
first focus was on the data application they
are which under some situations was losing
data it did not love for quickly coverage my
notes were crashing

and it wasn't flexible enough to build newer
and vision features such as cross cluster
replication out of this

was born a sequence number project so an
important internal project at elastic to
rework the date of application layer to
uniquely identify each right operation system
using a so called sequence number and also to
generally improve the robustness of the system
we started off with an informal specification
essentially a deck of PowerPoint slides from
which we derived our implementation efforts up
to that point we have been mostly relying our
infrastructure to put our code through a
series of players monkey-style tests
simulating various failures and then checking
whether nothing went wrong however we were
also looking at ways to complement this with
formal methods to this end at Reaper
Peterborough caught our attention

so Peter head of the distributed systems
Research Group at UC Santa Cruz

he was looking for collaboration on just this
topic and after short exchange of tweets and
if you follow up calls between Peter and Boas
was at the time leading distributed group and
elastic

it was decided koala a PhD student in Peters
group would join the team at elastic for a few
months over the summer to create a formula
model and to validate it using Mali a research
prototype developed by Peters group to find
bugs in distribute in specifications of
distributed systems so the model checker works
of a specification written in Daedelus which
is an extension of data lock and it outputs
are called Lambert diagrams or lineage graphs
to visualize any problematic traces that it
finds and while this former model now did not
uncover any issues you know informal
specification Gamal had validated at the end
of the summer some of the known issues with
our existing old model our replication system
providing evidence that such a formal approach
we would prune however the main issue we had
with that specific formal model was that it
was already very complex and difficult to
understand even though it wasn't covering the
fully informed specification and that this was
a research prototype double to some
limitations in the tooling so as a follow-up
investigated other techniques and tools to
model this and so at some point stumbled upon
T le plus and immediately liked it mainly
because it was great augmentation and also
excellent tooling so within a week's time

I created the basic specification of our data
replication model which we then refined over
the following months and which I use as basis
to discuss the finer points of the algorithm
with Boas were created in formal specification
ultimately this resulted in a tiller plus
model of our new data application

arisen it's been powering all the Asics
searched versions since version 6 which was
released in November 2017 so this new data
replication algorithm it identifies each
operation using a sequence number

gives us quickly coverage and has also served
as a foundation to build newer features such
as cross cluster replication which was also
released end of last year so a specification
contains 860 lines of commented Thiele plus
code and it checks the safety properties such
that even in the presence of Network petitions
no crashes that all acknowledge rights are
properly stored on audience in short copies
and that audience copies are properly aligned
once the system is again in stable state so
this was our first specification a Tier II +
specification for elasticsearch our next use
of T le plus was in a much different setting

so we studied two bugs in a hundy concurrent
component at a short level fight fixing these
bugs was tricky given how complex the
implementation already was and so in many
discussions around his bug fixes and various
safety arguments for them and so

at some point we decided to take a step back
and make use of T le bus before proceeding
with our bug fix

so he took the existing Java implementation we
mapped it onto a classical specification

then use the TLC model shaker to validate
presence of these two bucks

this also led us to discover an additional
unknown bug implementation which we only later
observed in the wild a similar more recent
example of this is where our testing
infrastructure uncovered the back which only
surfaced after running for months on CI and
again took the same approach took the Java
based implementation this time a pollutant
utila + specification and the TLC mole check
again was able to find about within seconds so
in all these cases of bug fixes were always
first prototyped in our t le plus or plus Co
specification and then validate with the model
checker before proceeding of putting a bug fix
into our production system this more recent
use of T APIs was also a great learning
opportunity for somebody new and the team to
extract model from the code and yet get
familiar with T le plus the last modified use
of T le plus I would like to showcase is one
where we've taken formal design

first approach

so we designed a new cluster coordination
subsystem

so the thing that's responsible for clustering
as well as metadata replication and we
validated it with T le plus before starting
off our implementation efforts the cluster
Coordination sub system works by selecting one
of the nodes in the cluster to be the master
and this elected master now has to make sure
that all the nodes in the cluster receive
updates to the cluster state this is harder
than it might first sound because distributed
systems like elasticsearch must be prepared to
deal with many strange situations so nodes can
sometimes run slowly they can experience long
garbage collection because it's written in
Java they can be power outage write networks
also unreliable unreliable you can have not
partitions you can have

periods of high latency packet loss messages
might arrive in different order in which they
were sent and all these kind of things can
happen all at once in canny kind of strange
combinations nevertheless the system must make
sure that every node has a somewhat consistent
view of this cluster state additionally
elasticsearch must be resilient to the
failures of individual nodes and achieves this
by requiring cluster state updates you only be
successful after they've been accepted by a
quorum of nodes

so chrome is a carefully chosen subset of the
nodes in the cluster and the advantage of only
requiring a quorum of nodes to successful
respond is then that individual nodes can fail
without impacting the overall clusters
availability chromis must also be carefully
chosen so that the cluster cannot elect two
independent masters that are making
inconsistent decisions as that again can lead
to data loss elastic search version 6 and
earlier use the cluster coordination subsystem
which was called send discovery this subsystem
successive powers clusters both small and
large however have some issues with it that we
wanted to address first of all the quorum size
was defined using a user configurable setting
which was called minimum master nodes and was
therefore vitally important to correctly
configure this on every node in the cluster
and to adapt it as you kept adding or removing
certain types of nodes failing to do so
brought risk of a so called split-brain
situations having two independent masters
making inconsistent decisions ultimately
leading to data loss then discovery had also a
rare failure mode we honor certain situations
it could lose classes it updates and that was
something it was far more fundamental to the
actual algorithm being used

so for last accept seven we completely
redesigned this cluster coordination subsystem
and and also completely implemented it first
of all we got rid of the minimum master node
setting in favor of having elastic search
itself determine which nodes can form a quorum
and this makes a growing n clusters much safer
and easier as the the system can now
automatically and safely adapt the chromes as
need be if you're familiar with the theory of
distributed systems then you may recognize
cluster coordination as an example of a
problem that can be solved using distributed
consensus implementing distributed consensus
was not as widely understood when development
of elastic search started we'll say much has
changed since then

so we're designing this cluster coordination
subsystem give us the opportunity to follow a
theoretical models much more closely

so if you're familiar with distributed
consensus algorithm such as paxos raft you
start replication zap that much of what we've
done will look very familiar to you note was
he hears that we separated out the safety bits
from the liveness bits of the algorithm

and so our le+ specification only covers the
safety bits it models a single rewritable
register which contains the cluster state and
besides typical parts of her class of a core
consensus algorithm it additionally also
models dynamically configuration just about
adapting the chromes as you're growing or
shrinking a cluster as well as cluster
bootstrapping which is about putting the
initial chromes into place and all of these
are highly important as they contribute to the
safety of the systems making sure that it that
he correctly behaves under all adverse
conditions now the T Laplace specification on
which we checked our safety properties

had we mapped on to a Java class and as you
can see in the snippets on the slide here our
Java implementation on the right-hand side
looks very similar to the T le plus code on
the left-hand side

so if you look at an example here on the left
hand side in the tio specification we require
for this word to trigger

we try to be in a state where we have won the
election and this is mapped onto a check in
our Java implementation which says if election
one is false we throw an exception

similarly our spec requires for the terms to
be matching with addition which is again
mapped on to check in on limitation excessive
terminals are not matching we throw an
exception

and so you can for every sub expression on the
left-hand side you can find a statement on the
right-hand side

and so it's pretty much very straightforward
translation from t le plus code to Java
implementation

so one important thing that we made in our
implementation is to make sure that every
every whenever elasticsearch accesses the
relevant state in implementation it is all
that access is threaded through this java
class essentially making sure that our system
is correct by design or it also means that the
specifications not written at the different
level of abstraction as for example let's
alembert has done for the pack suspect so this
is much closer to how you would code it up
then a high-level descriptive spec of
consensus algorithm finally given that we did
not envision to see many changes in this
implementation we just opted here for manual
translation from T le plus code to Java and
you see the sizes of ta plus specification as
well as the Java code tree

it's pretty low

so it's pretty easy to review that these two
are aligned right so until a-plus
specification and the Java implementation I
have shown us what's been powering all
elasticsearch versions since version 7 which
was released in April this year and if you
want to learn a bit more about that specific
use case there's a detailed blog post about
this I would also like to present a few
lessons learned here

so I showcase various use of clearly plus
classical as well as the TLC modern checker
which all have extensively contributed towards
creating a much safer and resilient system
we've used different levels of abstraction for
specification so sometimes closer to the code
and sometimes more of these high-level
descriptive specs so you should should use
whatever feels right for your specific purpose
in particular think long and hard what should
be nice back as well as what should not be in
the spec dealing with state space explosion is
always tricky and I think we use many tricks
in the book there like symmetry sets state
constraints we try to make sure that we cover
an interesting enough part of the state space
while also making sure that our model check
around terminates within a day or so

in particular we've made use of coverage
information to influence our state constraints
but in general would like to be a bit more
methodical about this

currently this relies very much on having like
a good understanding of the problem domain for
example for distribute consensus algorithm is
often said that using a model checker
configuration with three nodes helps you find
more of the box well in some cases you might
require five notes to find some of the more
special conditions in our case for our today
plus model given that we are dynamically
configuration most of our box we found
actually only with two nodes

so it's all very context dependent

yeah

the t le plus two box is very convenient used
and we're very happy with it and always super
excited

whenever there's new improvements there

whether it's additional coverage information
or whether it's about visualizing traces

so we had some minor issues with putting
teleclass specification on the version control
figuring out which files to exclude separating
source code from generated code separating
specification for model checker configuration
separating

and then also some of the issues with model
checker configurations containing machine
local information such as IP addresses so
separating these things a bit more clearly I
think might help on the collaborative aspect
tht model checker

well it's great at finding bugs and using a
model checking set of formal proofs which we
actually also work with you for the cluster
Coordination project

gave us it give us us at least four current
projects the right trade-off between effort
spend on validating specs and the benefits we
get from them

so what's the future holding for us while we
would like to see in which other places we can
make use of TL

a plus I so far it's been exclusively used by
the distributed sub team at elastic the main
reason

probably is that less exist that ela plus is
such a natural fit for distributed and
concurrent issues

so if you'd like to see some of these TLS
Chile Plus specification that I talked about
for itself all of them are publicly available
on our github repository just as well as the
as the the code of the system of the of the
system that we actually modeling

so if you want to learn more about the specs
as well as the relevant production code please
do have a look thank you [Applause] great
questions when you've been onboarding new new
developers and clearly some of your specs are
quite large and if they're new to TL

a plus or plus Cal or whatever the specs
written in have has been useful for them to
start out with smaller problems that aren't
necessarily even part of the spec proper or do
you usually just have them jump in in a
smaller scope to aspect or how they've been
approaching alright

so the most recent years of Chile plus was
actually one way we we had a new developer

just well we found it back in in some other
systems through CI testing

and then yeah we asked it was actually
developed himself

they said well maybe might be a good idea to
model this using TI

plus

and so it was for him a great learning
opportunity to just do that essentially
extract model from the code because working
with J plus is not only about T lackluster
language

but it's also about how do I create a proper
model

right

what's a good specification for for a certain
part of the system

and I think that was perhaps the biggest
learning opportunity they're going ahead

and and and and while extracting and figuring
out what the model is from the existing code

and so that might be a good good first steps

and she taking something that's already there
and then properly conceptualizing it into in
terms of a le class specification and then
using playing with the model checker to to to
either figure out existing box or to rule out
such box and that area of the code hadn't been
inspected before so

it was all green

yes

yes

yes

but it was

like it was let's say it was a very targeted
thing

so it was

it was in this case

it was it related to the atomic assistance of
our cluster state

and so it was really at the storage layer

like it was

I don't know it made five hundred lines of
code class or something like that

and the core algorithm was much smaller

it was something I think the actual tier a
plasma before that must maybe to two pages

or so so it was pretty contained

hi you said you modeled by Venus properties in
a separate layer on top

could you talk just a tiny bit about that

oh so we did not model likeness properties
using GLA

plus so we check licensed properties
extensively using testing

okay

yeah

I can go more to that

but it's our different subject

maybe we take that offline next one

otherwise I have one

so you said you specified some bits of your
system and plus color and other parts and ta+

what's the story there

it's essentially a developer's preference

so I prefer to le

plus

and so when I created the initial spec when
we've till a plus

then well I think for whenever your reverse
modeling existing code in some places might be
more convenient to do it plus girl especially
if you have very complex flows

but

yeah

I think often times I would say oftentimes
it's mostly just about personal preference

mm-hm

and is it so that newbies to TL A+ prefer to
start with plus Kyle who is your company

no

I don't think so

actually I found that at least in our company
that people find or many people find totally
Plus easier to read it's a simpler simpler
model simple semantics or very simple
semantics whereas if you use plus girl you
have these additional like this additional
layer of complexity on top of it

and you still need to at least have a decent
understanding of of off of ta+

anyway

so it's just adding things on top of okay more
questions I will be interested in knowing like
what's the Andorian see what's the general
preference for four plus Gulliver's is still a
plus maybe who is used mostly plus cow for
example quick show of hands who uses Pascal

regularly okay who uses t le plus regularly
who use this alloy

okay

well with that then thanks again thank you
[Applause]
:END:

